#include <stdio.h>
#define N 30             //σταθερά Ν 30
#define K 6              //σταθερά K 6
#define L 21             //σταθερά L 21
int main(){                       //   1   2   3   4   5   6       8   9       11      13      15      17      19          22          25      27      29  30
    char input[N], characters[K][N]={{'Y','N','Y','N','N','Y','N','Y','N','Y','N','Y','N','Y','N','Y','N','Y','N','Y','N','Y','N','Y','N','Y','N','Y','N','Y'},//ok
                                     {'N','Y','N','Y','N','Y','N','Y','N','Y','N','Y','N','Y','N','Y','N','Y','N','Y','N','Y','N','Y','N','Y','N','Y','N','Y'},//ok
                                     {'Y','Y','Y','Y','Y','N','N','N','N','N','Y','Y','Y','Y','Y','N','N','N','N','N','Y','Y','Y','Y','Y','N','N','N','N','N'},//ok
                                     {'Y','Y','Y','Y','Y','Y','Y','Y','Y','Y','Y','Y','Y','Y','Y','Y','Y','Y','Y','Y','Y','Y','Y','Y','Y','Y','Y','Y','Y','Y'},//ok
                                     {'N','N','N','N','N','N','N','N','N','N','N','N','N','N','N','N','N','N','N','N','N','N','N','N','N','N','N','N','N','N'},//ok
                                     {'N','N','N','N','N','Y','Y','Y','Y','Y','N','N','N','N','N','Y','Y','Y','Y','Y','N','N','N','N','N','Y','Y','Y','Y','Y'} //ok
                                },  // |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |   |
                      adress[K][L]={ {'1','3','0','2',' ','C','O','L','E','R','I','D','G','E',' ','A','V','E','N','U','E'},     //ok
                                     {'2','3','1','1',' ','A','V','E','N','U','E',' ','A',' ','W','E','S','T','\0','\0','\0'},  //ok
                                     {'1','0','6','5','5','6',' ','R','O','N','D','O',' ','A','V','E','N','U','E','\0','\0'},   //ok
                                     {'1','4','2','4',' ','W','E','S','T','C','H','E','S','T','E','R',' ','R','O','A','D'},     //ok
                                     {'1','1','1',' ','N','.',' ','M','O','N','T','G','O','M','E','R','Y',' ','R','D','.'},     //ok
                                     {'5','3',' ','N','E',' ','R','D','.',' ','S','T','R','E','E','T','\0','\0','\0','\0','\0'} //ok
                                   };
    int points[K]={0}, percent[K],i,j;
    printf("Give your Answers (N/Y)\n");
    for (i=0; i<N; i++){
        scanf(" %c", &input[i]); }       //εισαγωγή της σειράς απαντήσεων
    for (i=0; i<N; i++){
        while(input[i]!='N'&&input[i]!='Y'){       //έλεγχος εισαγωγής σειράς χαρακτήρων (Ν/Υ)
            printf("\n Wrong Input at the #%d character, Write only the character Again!\n", i+1);
            scanf(" %c", &input[i]);
        }
         for (j=0; j<K; j++){
            if (input[i]==characters[j][i]) { //σύγκριση απάντησης σύγκριση με τα δεδομένα 
                points[j]++; }                //αύξυση κατα 1 αν συμπίπτουν
         }
    }
    for (j=0; j<K; j++){
        percent[j] = (points[j]*100)/30;  // μετατροπή αριθμών σε ντισεκατόν 
        for (i=0;i<L;i++)
            if (adress[j][i]!='\0')          // 1) μεχρι να φτάσει τον NULL στο πινακα
                printf("%c", adress[j][i]);  // 2) εκτύπωση όλων των διευθύνσεων
        printf(" : %d/30", points[j]);       //εκτύπωση πόσων συμπίπτουν απο τα 30
        if (percent[j]<80)
            printf (" : NO \n");             //εκτύπωση "ΝΟ" αν ειναι <80%
        else 
            printf(" : Possible \n");        //εκτύπωση "Possible" αν ειναι >80%
    }
return 0;
}



