#include <stdio.h>

// Ορισμός μιας δομής για την αναπαράσταση των δεδομένων πελάτη
struct clientData {  
    int acctNum;            // Αριθμός λογαριασμού
    char lastName[15];      // Επώνυμο πελάτη (μέχρι 14 χαρακτήρες + τερματισμός null)
    char firstName[10];     // Όνομα πελάτη (μέχρι 9 χαρακτήρες + τερματισμός null)
    float balance;          // Υπόλοιπο λογαριασμού
};

int main() {  
    int i; // Μετρητής επαναλήψεων

    // Αρχικοποίηση ενός κενoύ πελάτη με προεπιλεγμένες τιμές
    struct clientData blankClient = { 0, "", "", 0.0 };

    // Δείκτης αρχείου για την εγγραφή των δεδομένων
    FILE *cfPtr; 

    // Προσπάθεια ανοίγματος του αρχείου "credit.txt" σε λειτουργία εγγραφής
    if ((cfPtr = fopen("credit.txt", "w")) == NULL) {
        // Εάν το αρχείο δεν μπορεί να ανοίξει, εμφάνιση μηνύματος σφάλματος
        printf("File could not be opened.\n"); 
    } else {  
        // Εγγραφή 100 κενών εγγραφών πελατών στο αρχείο
        for (i = 1; i <= 100; i++) {
            fwrite(&blankClient, sizeof(struct clientData), 1, cfPtr); 
        }

        // Κλείσιμο του αρχείου μετά την εγγραφή
        fclose(cfPtr); 
    }

    return 0; // Επιστροφή 0 για επιτυχή τερματισμό του προγράμματος
}